Revit 2025 API
TaskDialogCommonButtons Enumeration
A enumerated type containing the standard buttons available for Task Dialogs.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
[FlagsAttribute]
public enum TaskDialogCommonButtons
<FlagsAttribute>
Public Enumeration TaskDialogCommonButtons
[FlagsAttribute]
public enum class TaskDialogCommonButtons
[<FlagsAttribute>]
type TaskDialogCommonButtons
Members
Member name | Value | Description
None | 0 | No common button.
Ok | 1 | OK button.
Yes | 2 | Yes button.
No | 4 | No button.
Cancel | 8 | Cancel button.
Retry | 16 | Retry button.
Close | 32 | Close button.
See Also
Reference
Autodesk.Revit.UI Namespace